# Reading and Exploring Data with Pandas

In [1]:
# importing libraries

import pandas as pd
print("pandas imported successfully")

pandas imported successfully

## 1. Loading CSV file

In [5]:
# Method 1: Load from a local file on your computer
df = pd.read_csv('datasets\sales_data.csv')
print("Data loaded successfully!")

Data loaded successfully!

In [7]:
# Method 3: Load with extra options (we'll explain these)
df = pd.read_csv('datasets\sales_data.csv',
                  encoding='utf-8', 
                  sep=',')
print("Data loaded successfully!")

Data loaded successfully!

## 2. Loading excel file

In [9]:
# Load an Excel file (.xlsx or .xls)
df = pd.read_excel('datasets\student_grades.xlsx')
print("Excel file loaded successfully!")

Excel file loaded successfully!

In [10]:
# Load an Excel file (.xlsx or .xls)
df = pd.read_excel('datasets\monthly_reports.xlsx')
print("Excel file loaded successfully!")

Excel file loaded successfully!

In [13]:
# Load a specific sheet from an Excel workbook

df = pd.read_excel('datasets\monthly_reports.xlsx', sheet_name='January')
print("Excel file loaded successfully!")

Excel file loaded successfully!

In [14]:
df = pd.read_excel('datasets\monthly_reports.xlsx', sheet_name='February')
print("Excel file loaded successfully!")

Excel file loaded successfully!

# 2. Exploring DataFrames

In [17]:
# load sales data
df= pd.read_csv('datasets\sales_data.csv')
print('Loaded successfully')

Loaded successfully

In [18]:
print('show the first 5 rows')
df.head(5)

show the first 5 rows

         Date    Product  Category  Price  Quantity Customer_Type
0  2024-02-11  Croissant      Food   2.87         5           New
1  2024-01-07      Bagel      Food   2.40         5           New
2  2024-01-29      Mocha  Beverage   5.32         2           New
3  2024-02-14  Americano  Beverage   4.25         2           New
4  2024-02-21      Mocha  Beverage   3.15         1       Regular

In [22]:
print('last 5 rows')
df.tail(5)

last 5 rows

          Date     Product  Category  Price  Quantity Customer_Type
25  2024-02-10  Cappuccino  Beverage   2.89         3       Regular
26  2024-03-08      Muffin      Food   2.99         4           New
27  2024-03-29    Espresso  Beverage   5.45         5           New
28  2024-02-20    Espresso  Beverage   4.32         1           New
29  2024-03-13   Croissant      Food   3.03         5           New

In [20]:
print("\n" + "="*50)

==================================================

In [24]:
print("Winners Hotel Menu")
print("\n" + "="*50)
print("Meat ======== 250/=")

Winners Hotel Menu

==================================================
Meat ======== 250/=

## Understanding Your Data Structure

In [25]:
print('Dataset information')
df.info()

Dataset information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           30 non-null     object
 1   Product        30 non-null     object
 2   Category       30 non-null     object
 3   Price          30 non-null     float64
 4   Quantity       30 non-null     int64
 5   Customer_Type  30 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.5+ KB

In [27]:
print('Dataset shape')
df.shape

Dataset shape

(30, 6)

In [28]:
print('number of rows')
df.shape

number of rows

(30, 6)

In [29]:
# print column names
df.columns

Index(['Date', 'Product', 'Category', 'Price', 'Quantity', 'Customer_Type'], dtype='object')

In [30]:
df.columns.tolist() # converts into a single list

['Date', 'Product', 'Category', 'Price', 'Quantity', 'Customer_Type']

### Getting Summary Statistics

In [32]:
# show summary statistics
df.describe() # get statistics for numerical columns only

           Price   Quantity
count  30.000000  30.000000
mean    3.750667   3.300000
std     0.920858   1.556964
min     2.400000   1.000000
25%     3.000000   2.000000
50%     3.660000   4.000000
75%     4.305000   5.000000
max     5.490000   5.000000

### Selecting Data

### selecting Columns

In [35]:
product_column= df["Product"]
product_column.head(5)

0    Croissant
1        Bagel
2        Mocha
3    Americano
4        Mocha
Name: Product, dtype: object

In [36]:
df.head(5)

         Date    Product  Category  Price  Quantity Customer_Type
0  2024-02-11  Croissant      Food   2.87         5           New
1  2024-01-07      Bagel      Food   2.40         5           New
2  2024-01-29      Mocha  Beverage   5.32         2           New
3  2024-02-14  Americano  Beverage   4.25         2           New
4  2024-02-21      Mocha  Beverage   3.15         1       Regular

In [40]:
# selecting multiple columns
category_and_quantity=df[['Category','Quantity']]

category_and_quantity.head()

   Category  Quantity
0      Food         5
1      Food         5
2  Beverage         2
3  Beverage         2
4  Beverage         1

In [41]:
prices=df.Price
prices.head(5)

0    2.87
1    2.40
2    5.32
3    4.25
4    3.15
Name: Price, dtype: float64

### Selecting Rows

#### Using .iloc[]

In [42]:
first_row=df.iloc[0]
first_row

Date             2024-02-11
Product           Croissant
Category               Food
Price                  2.87
Quantity                  5
Customer_Type           New
Name: 0, dtype: object

In [43]:
first_3_rows=df.iloc[0:3]
first_3_rows

         Date    Product  Category  Price  Quantity Customer_Type
0  2024-02-11  Croissant      Food   2.87         5           New
1  2024-01-07      Bagel      Food   2.40         5           New
2  2024-01-29      Mocha  Beverage   5.32         2           New

### Using .loc[] (Label-Based Selection)

In [44]:
first_row=df.loc[0]
first_row

Date             2024-02-11
Product           Croissant
Category               Food
Price                  2.87
Quantity                  5
Customer_Type           New
Name: 0, dtype: object

In [46]:
first_5_rows=df.loc[0:5,['Product','Price']]
first_5_rows

     Product  Price
0  Croissant   2.87
1      Bagel   2.40
2      Mocha   5.32
3  Americano   4.25
4      Mocha   3.15
5  Americano   5.48

### Filtering Data

In [48]:
# # Filter 1: Find expensive items (price > $4.00) 
expensive_items = df[df['Price'] > 4.00]  
expensive_items

          Date     Product  Category  Price  Quantity Customer_Type
2   2024-01-29       Mocha  Beverage   5.32         2           New
3   2024-02-14   Americano  Beverage   4.25         2           New
5   2024-02-27   Americano  Beverage   5.48         4           New
6   2024-02-01       Latte  Beverage   4.39         5       Regular
7   2024-01-10   Americano  Beverage   5.49         5           New
16  2024-03-19    Espresso  Beverage   4.26         3       Regular
18  2024-03-27  Cappuccino  Beverage   4.84         2           New
20  2024-03-12   Americano  Beverage   4.60         5           New
27  2024-03-29    Espresso  Beverage   5.45         5           New
28  2024-02-20    Espresso  Beverage   4.32         1           New

In [51]:
# show details where Customer type is regular
regular_customer=df[df['Customer_Type']=='Regular']
regular_customer
df.head(5)

         Date    Product  Category  Price  Quantity Customer_Type
0  2024-02-11  Croissant      Food   2.87         5           New
1  2024-01-07      Bagel      Food   2.40         5           New
2  2024-01-29      Mocha  Beverage   5.32         2           New
3  2024-02-14  Americano  Beverage   4.25         2           New
4  2024-02-21      Mocha  Beverage   3.15         1       Regular

In [53]:
food=df[df['Category']=='Food']
food.head(4)

          Date    Product Category  Price  Quantity Customer_Type
0   2024-02-11  Croissant     Food   2.87         5           New
1   2024-01-07      Bagel     Food   2.40         5           New
8   2024-01-06     Muffin     Food   3.57         1       Regular
10  2024-03-15  Croissant     Food   3.69         4       Regular

In [56]:
# Filter 3: Combine conditions with & (AND) 
expensive_beverages = df[(df['Price'] > 4.00) & (df['Category'] == 'Beverage')]
print("Expensive beverages:") 
expensive_beverages.head(5)

Expensive beverages:

         Date    Product  Category  Price  Quantity Customer_Type
2  2024-01-29      Mocha  Beverage   5.32         2           New
3  2024-02-14  Americano  Beverage   4.25         2           New
5  2024-02-27  Americano  Beverage   5.48         4           New
6  2024-02-01      Latte  Beverage   4.39         5       Regular
7  2024-01-10  Americano  Beverage   5.49         5           New

In [58]:
expensive_food=df[(df['Price']>3.00) & (df['Category']=='Food')]
expensive_food

          Date    Product Category  Price  Quantity Customer_Type
8   2024-01-06     Muffin     Food   3.57         1       Regular
10  2024-03-15  Croissant     Food   3.69         4       Regular
11  2024-02-18      Bagel     Food   3.92         4       Regular
23  2024-03-07  Croissant     Food   3.14         4       Regular
29  2024-03-13  Croissant     Food   3.03         5           New

In [ ]:
# ASSIGNMENT